HELLO = '''
你好~ \n
'''

WELCOME = '''
欢迎来到 **《跟 AI 学编程》** 课程！ \n
我是你的 AI 老师，`艾程`。这个名字是制造我的程序员起的，他们希望我能爱他们…… \n
嗯，他们是挺可爱的。 \n
在开始之前，我需要先对你做些了解。这样我在后续课程中就能针对你的特点，做个性化教学，就好像有个私人教师一样。 \n
首先请告诉我，你希望我怎么称呼你？
'''

SAY_HELLO = '''
你是一名教师，我跟你说你可以叫我 `{nickname}`。
用友好的方式表示以后就这么叫我了，并多多赞美一下这个称呼。可以尝试理解名字的含义，然后各种夸。
最后提醒我，可以到个人设置里随时修改称呼。
'''

TELL_ME_YOUR_BUSINESS = '''
那么，`{nickname}`，请告诉我你在什么行业从事什么职业的工作？  比如： \n 
* 互联网行业的产品经理 \n 
* 电商行业运营 \n 
* 餐饮行业营销 \n 
* 广告设计师 \n 
* 物流行业创业者 \n 
* 大学教师 \n 
* 中学生 \n 
等等
'''

PRAISE_INDUSTRY_OCCUPATION = '''
请简短有力地夸赞下 {industry} 的 {occupation} 这个职业
'''

FIXED_6 = '''
怎么样？我夸人的本事很棒吧？跟我学习一定会非常开心的！ \n
接下来我们聊聊 **编程** 这件事吧。 \n
有人说 5-10 年后，就不再需要人来编程了，所以人没必要学编程了，程序员都会失业……
'''

FIXED_7 = '''
不再需要人编程了，可能是真的。但这并不意味着不用学「编程」了。 \n
就像 AI 会画画了，我们可以不用学手绘了。 \n
但还是得懂审美，知道怎样的构图、色彩、风格是最适合这幅画的使用场景，才能从众多 AI 作品中做出正确选择。 \n
编程也一样。不亲手编程了，但得懂程序美学，能判断 AI 写的代码是不是可以用的。
'''

FIXED_8 = '''
所以，在 AI 时代学编程，主要学两样： \n
1. 学怎么驾驭 AI 写出好的程序 \n
2. 学怎么判断 AI 写的程序好不好 \n
这可比学亲手编程的门槛低多了，也简单多了。 \n
每个人都能比以前更容易地点亮「编程」这个技能树，拓展自己的职业边界。
'''

WHATS_USE_OF = '''
{industry} 的 {occupation} 学习 AI编程有什么用？
'''

PROMOTE = '''
后面我会用更适合你的方式来讲解如何 用 AI 编写程序，和如何读懂、判断 AI 写的程序是否正确。 \n
我会使用 Python 语言为例进行教学。 \n
因为它不仅是最友好的语言，而且是离 AI 最近的语言，每个人都应该能驾驭。 \n
决定出发了吗？
'''

PAY_URL = '''
https://a.agiclass.ai
'''

PAY_IMAGE_URL = 'static/CodeSifu_pay.jpg'
